## Plan Result (privatelink - TerraformPlanApply)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.azure-notebooks-private-link.azurerm_private_dns_zone.zone[0]
  * module.azure-notebooks-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;ingest00-vnet-sbox&#34;]
  * module.azure-notebooks-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;private-dns-resolver-uksouth-vnet-prod-int&#34;]
  * module.azure-notebooks-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;vpn&#34;]
  * module.cognitiveservices-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;ingest00-vnet-sbox&#34;]
  * module.machine-learning-private-link.azurerm_private_dns_zone.zone[0]
  * module.machine-learning-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;ingest00-vnet-sbox&#34;]
  * module.machine-learning-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;private-dns-resolver-uksouth-vnet-prod-int&#34;]
  * module.machine-learning-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;vpn&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.azure-notebooks-private-link.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.notebooks.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }

      + soa_record (known after apply)
    }

  # module.azure-notebooks-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["ingest00-vnet-sbox"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "ingest00-vnet-sbox"
      + private_dns_zone_name = "privatelink.notebooks.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox"
    }

  # module.azure-notebooks-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["private-dns-resolver-uksouth-vnet-prod-int"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "private-dns-resolver-uksouth-vnet-prod-int"
      + private_dns_zone_name = "privatelink.notebooks.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/private-dns-resolver-uksouth-prod-int/providers/Microsoft.Network/virtualNetworks/private-dns-resolver-uksouth-vnet-prod-int"
    }

  # module.azure-notebooks-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["vpn"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "vpn"
      + private_dns_zone_name = "privatelink.notebooks.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/mgmt-vpn-2-mgmt/providers/Microsoft.Network/virtualNetworks/mgmt-vpn-2-vnet"
    }

  # module.cognitiveservices-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["ingest00-vnet-sbox"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "ingest00-vnet-sbox"
      + private_dns_zone_name = "privatelink.cognitiveservices.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox"
    }

  # module.machine-learning-private-link.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.api.azureml.ms"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }

      + soa_record (known after apply)
    }

  # module.machine-learning-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["ingest00-vnet-sbox"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "ingest00-vnet-sbox"
      + private_dns_zone_name = "privatelink.api.azureml.ms"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox"
    }

  # module.machine-learning-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["private-dns-resolver-uksouth-vnet-prod-int"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "private-dns-resolver-uksouth-vnet-prod-int"
      + private_dns_zone_name = "privatelink.api.azureml.ms"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/private-dns-resolver-uksouth-prod-int/providers/Microsoft.Network/virtualNetworks/private-dns-resolver-uksouth-vnet-prod-int"
    }

  # module.machine-learning-private-link.azurerm_private_dns_zone_virtual_network_link.vnet_link["vpn"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "vpn"
      + private_dns_zone_name = "privatelink.api.azureml.ms"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Medium"
          + "environment"  = "ithc"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/mgmt-vpn-2-mgmt/providers/Microsoft.Network/virtualNetworks/mgmt-vpn-2-vnet"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":894,"Program":"tfcmt","SHA1":"","Target":"privatelink - TerraformPlanApply","Vars":{}} -->